{
    "posts": [
      {
        "id": 1,
        "author": "Lauren Forristal",
        "date": "April 19, 2022",
        "title": "HBO Max backs 'Minecraft' movie with 'Aquaman' star Jason Momoa",
        "summary": "It appears HBO Max is creeping up behind Netflix and Paramount+ with new gaming IP under its belt. The Hollywood Reporter confirmed that Jason Momoa is in final negotiations to star in the Warner Bros. live-action 'Minecraft' movie.",
         "body": "It appears HBO Max is creeping up behind Netflix and Paramount+ with new gaming IP under its belt. The Hollywood Reporter confirmed that Jason Momoa is in final negotiations to star in the Warner Bros. live-action 'Minecraft' movie. The popular video game Minecraft, loved by 11-year-olds and YouTube gamers, debuted in 2011 and allows players to create worlds and structures with brown, green, and other colorful pixelated blocks. The game exploded in popularity, as stores filled up their aisles with merchandise like those foam swords and mystery toy boxes. Then, in 2014, a few years after its launch, Microsoft acquired Mojang for $2.5 billion. The Minecraft franchise is still very popular, having been brought to multiple video game systems, given spinoffs, and won many awards since its launch. In December, it surpassed one trillion views (yes, I said trillion) on YouTube and in 2021, there were over 140 million monthly users. So it’s not at all surprising that Warner Bros. would want their hands on such a popular IP universe."
      },
      {
        "id": 2,
        "author": "Mary Ann Azevedo",
        "date": "April 19, 2022",
        "title": "Playbook, where 'Pinterest meets Dropbox' for designers, closes on $18M in funding",
        "summary": "Playbook, which describes itself as a 'creative file manager for designers' where 'Pinterest meets Dropbox,' raised $18M in round led by Bain Capital Ventures.",
        "body": "Playbook, a startup that describes itself as a 'creative file manager for designers' where 'Pinterest meets Dropbox,' has raised $18 million in a Series A funding round led by Bain Capital Ventures.   CEO Jessica Ko was inspired to start the company after her experiences as a designer at Google and Opendoor. She realized that her teams were spending about 90% of their time digging around Dropbox looking for assetse process wasted time and money, in her view. So in 2018, Ko left Opendoor to set about solving the problem she was tired of dealing with by creating file storage for modern design workflows and processes. Or put more simply, she wanted to build a new kind of cloud storage that would serve as an alternative to Dropbox and Google Drive 'built by, and for, creatives.'"
      },
      {
        "id": 3,
        "author": "Brian Heater",
        "date": "April 19, 2022",
        "title": "Recycling robotics firm Glacier emerges from stealth with $4.5M",
        "summary": "Glacier Robotics emerges from stealth with $4.5M; funding will go toward increasing headcount and accelerating the system's commercial deployment.",
        "body": "I've got to admit, the respective pedigrees of Glacier's founders are a bit unexpected for a recycling robotics company. Areeb Malik used to be a software engineer at Facebook, and Rebecca Hu worked at Bain and Company. 'While working at Bain, I found myself developing dual interests in industrials and consumer goods,” Hu tells TechCrunch. “Recycling automation is uniquely positioned at the intersection of those two industries — we’re building infrastructure to handle the byproducts of our consumerism. When you also factor in my experience scaling several high-growth startups, building a recycling automation startup was a natural next step for me.' But the firm, which has thus far been operating in stealth, has already attracted the attention of some key names, including former GE CEO Jeff Immelt, former Uber CPO Manik Gupta and Climate Tech VC co-founder, Sophie Purdom. The trio participated in the startup’s just-announced $4.5 million seed round, led by New Enterprise Associates (NEA). The funding will go toward increasing headcount and accelerating the system’s commercial deployment. Founded in 2019, Glacier has run a number of pilots. More recently, it launched its first commercial system at a facility in Los Angeles. I’m sure I don’t need to tell you how massive an issue recycling is. It’s something a lot of smart people have been working on for a very long time — and yet, there are still major stumbling blocks when it comes to reclaiming and repurposing the unthinkable volumes of waste humans create every year."
      }
     
    ]
  }